app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Hi"], ["user_id", 2], ["created_at", "2020-11-05 13:00:20.989181"], ["updated_at", "2020-11-05 13:00:20.989181"]]
---
  def create
    message = current_user.messages.new(message_params)
    if message.save

SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC LIMIT $1  [["LIMIT", 50]]
---
  def get_messages
    @messages = Message.order(:created_at).last(50)